app/controllers/drinks_controller.rb

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 1]]
---
  def choose
    # Need to recieve params[:choice_id](drink selected id).

    if session[:drink_ids] == nil
      p "THIS IS IN THE SESSION CREATION PART"
      session[:drink_ids] = params[:id]
    end

    if params[:choice_id]
      p "THIS IS IN THE CHOICE ID STATEMENT"
      # If drink is chosen, return json of the drink
      @drink = Drink.find(params[:choice_id])

SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", nil]]
---
  def index
    @bar = Bar.find(params[:bar_id])