app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "drinks".* FROM "drinks" WHERE "drinks"."bar_id" IS NULL
SELECT "tags"."id" FROM "tags" INNER JOIN "drinks_tags" ON "tags"."id" = "drinks_tags"."tag_id" WHERE "drinks_tags"."drink_id" = $1  [["drink_id", 1]]
---
  def index
    # tag choosing logic
    if !params[:id]
      @tag1 = Tag.find(1)
      @tag2 = Tag.find(36)
      render json: [@tag1, @tag2]
    end
    @selected_tag = Tag.find(params[:id])
    if session[:tags] == nil
      session[:tags] = []

    end
    session[:tags] << @selected_tag.id
    @next_tags = @selected_tag.children

    # Drink choosing logic
    @drink_ids = []
    if @next_tags.length === 0
      @drink_choices = []
      @bars_drinks = Drink.all
      @bars_drinks.each do |drink|
        @drink_tags_array = drink.tags.pluck(:id)